{
  "backend/main.mo": "Main Motoko actor defining data types (Book, BorrowRecord, Reservation, DigitalResource, Announcement, UserProfile) and all backend canister methods for a library management system, including CRUD operations, borrowing/returning, reservations, and admin functions with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to the specific frontend files and components involved, covering fixes for the Book Catalog, Student Dashboard tabs, and Admin Dashboard data loading.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the project's React/TypeScript frontend structure and purpose of each file.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark color themes, including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'VEMU Institute of Technology Library Portal' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Query, TanStack Router with routes for landing, login, signup, student dashboard, and admin dashboard, wrapped in theme and auth providers.",
  "frontend/src/components/admin/AddAnnouncementModal.tsx": "A modal dialog form for creating new announcements with title, body, priority, and publish date fields, submitting via the useAddAnnouncement mutation.",
  "frontend/src/components/admin/AddBookModal.tsx": "A modal dialog for adding or editing a book record (title, author, category, ISBN, copies, description), supporting both create and update operations via respective mutations.",
  "frontend/src/components/admin/AddDigitalResourceModal.tsx": "A modal dialog form for adding a new digital resource (title, description, URL, category) to the library, submitting via the useAddDigitalResource mutation.",
  "frontend/src/components/admin/BorrowRecordsTab.tsx": "An admin tab that displays all borrow records in a searchable, filterable table with status indicators (active, returned, overdue) derived from borrow and book data.",
  "frontend/src/components/admin/EditAnnouncementModal.tsx": "A modal dialog for editing an existing announcement's title, body, priority, and publish date, pre-populated from the selected announcement and submitted via the useEditAnnouncement mutation.",
  "frontend/src/components/admin/EditBookModal.tsx": "A modal dialog component for editing an existing book's details (title, author, category, ISBN, copies, description) with form validation and mutation via `useEditBook`.",
  "frontend/src/components/admin/EditDigitalResourceModal.tsx": "A modal dialog component for editing a digital resource's details (title, description, URL, category) with validation and mutation via `useEditDigitalResource`.",
  "frontend/src/components/admin/ManageBooksTab.tsx": "Admin tab component that displays a searchable, filterable table of all books with options to add, edit, and delete books, restricted by user role.",
  "frontend/src/components/admin/ManageDigitalResourcesTab.tsx": "Admin tab component that lists all digital resources in a searchable table with add, edit, and delete functionality using respective modals and mutations.",
  "frontend/src/components/admin/ManageUsersTab.tsx": "Admin tab component that displays a searchable, read-only table of all registered users showing their name, email, principal ID, role, and join date.",
  "frontend/src/components/admin/OverviewTab.tsx": "Renders the admin dashboard overview tab with stat cards (total books, users, borrowed, overdue) and an active users card, fetching data via React Query hooks and displaying animated counters with loading skeletons.",
  "frontend/src/components/admin/ReservationsTab.tsx": "Displays a filterable, searchable table of all library reservations with approve/reject actions, mapping book and user IDs to names and showing status badges.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a number from 0 to a target value using requestAnimationFrame with a cubic ease-out curve over a configurable duration.",
  "frontend/src/components/BookCatalog.tsx": "Student-facing book catalog component with search and category filtering, borrow button per book card, loading skeletons, error state, and a 'Showing X of Y books' count, consuming the useGetAllBooks and useBorrowBook hooks.",
  "frontend/src/components/BorrowedBooksList.tsx": "Displays a tabbed list of a user's active and returned borrowed books, with overdue detection and a return book action using mutation hooks.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with VEMU branding, quick navigation links, contact info, and a caffeine.ai attribution.",
  "frontend/src/components/MyReservations.tsx": "Shows the current user's book reservations sorted by date, with status badges and a cancel action for pending reservations.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with role-aware links, logout functionality, theme toggle, and a responsive mobile menu.",
  "frontend/src/components/NoticeBoard.tsx": "Fetches and displays library announcements sorted by date, highlighting urgent ones with distinct styling and an optional display limit.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name and email on first login and saves their profile via a mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login and enforces optional role-based access control.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the ThemeContext, displaying a Sun or Moon icon accordingly.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context including user role, persisted principal, and logout functionality, fetching the role from the backend actor when identity changes and caching it in localStorage.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a light/dark theme context that persists the selected theme to localStorage and toggles the 'dark' class on the document root.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor instance using React Query, initializing it with the current Internet Identity and invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication hook and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for interacting with the backend actor, covering books, borrow/return records, reservations, users, digital resources, announcements, and dashboard stats.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Inter), sets up Tailwind directives, and defines CSS custom properties for light/dark themes including navy, gold, and sidebar color tokens, plus utility component classes like btn-gold and btn-navy.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a collapsible sidebar for navigating Overview, Manage Books, Manage Users, and Borrow Records tabs; redirects unauthenticated users and shows an access-denied screen for non-admins.",
  "frontend/src/pages/DigitalResources.tsx": "Page that fetches and displays digital resources with search and category filter chip controls, rendering resource cards with category icons and an external link button.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page featuring a hero section with a background video/image, animated stat counters, and a features grid; navigates authenticated users to their dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication, fetches the user's role after login, and redirects admins to /admin and regular users to /dashboard.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that authenticates users via Internet Identity, fetches their role after login, and redirects admins to /admin or others to /dashboard. Displays a step-by-step onboarding UI with error handling.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page with tabs for browsing books (BookCatalog) and viewing borrowed books (BorrowedBooksList), guarded by authentication and showing a profile setup modal if no profile exists.",
  "frontend/src/pages/StudentProfile.tsx": "Student profile page displaying user info, active loans, borrow history, and reservations by composing data from useGetCallerUserProfile, useGetMyBorrowHistory, and useGetAllBooks hooks.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, with helpers to persist values in sessionStorage and remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Inter), OKLCH-based color tokens (navy, gold, semantic colors), custom shadows, and animation keyframes.",
  "project_state.json": "Project state manifest tracking version, known deployment issues, existing fix-request features (book catalog, dashboard tabs, admin dashboard, actor initialization), and new feature requests for the library app."
}