{
  "backend/main.mo": "Main Motoko actor defining the library backend with types and state for books, borrow records, and user profiles, plus CRUD operations gated by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report confirming that LandingPage.tsx implements an autoplaying, muted, looping hero background video with overlay, fallback poster image, and all original content preserved above the video layer.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of every frontend source file, describing each component's purpose, styling approach, and key functionality for build planning reference.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom property tokens for light and dark themes covering background, foreground, card, sidebar, chart, and other UI color roles.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'VEMU Institute of Technology Library Portal' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for landing, login, signup, student dashboard, and admin dashboard, wrapping the app in ThemeProvider and rendering a shared Navbar/Footer layout.",
  "frontend/src/components/admin/AddBookModal.tsx": "Admin dialog form for adding a new book to the library, with validation and a backend mutation call via useAddBook.",
  "frontend/src/components/admin/BorrowRecordsTab.tsx": "Admin tab that displays all borrow records in a searchable, filterable table with status badges (active, returned, overdue), fetching data via useGetAllBorrowRecords and useGetAllBooks hooks.",
  "frontend/src/components/admin/ManageBooksTab.tsx": "Admin tab for viewing and managing the book collection with search, add (via modal), and delete (stubbed as unsupported) functionality displayed in a table.",
  "frontend/src/components/admin/ManageUsersTab.tsx": "Admin tab that lists all registered users in a searchable table showing name, email, truncated principal, role badge, and join date.",
  "frontend/src/components/admin/OverviewTab.tsx": "Admin dashboard overview tab that displays animated stat cards (total books, users, borrowed, overdue) and a quick summary list using data from useGetDashboardStats.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a number from 0 to a target value using requestAnimationFrame with a cubic ease-out curve over a configurable duration.",
  "frontend/src/components/BookCatalog.tsx": "Book catalog component with search and category filter inputs, a responsive grid of book cards, borrow buttons with loading states, and toast notifications for borrow success or failure.",
  "frontend/src/components/BorrowedBooksList.tsx": "Displays a tabbed list of a user's active and historical book borrowings, with overdue indicators and a return book action that calls the backend mutation.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, contact info, and a copyright notice for the VEMU Library Portal.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, role-aware links (admin vs. user dashboard), theme toggle, login/logout actions, and a responsive mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name and email on first login and saves the profile via the backend mutation.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to login, enforces optional role requirements, and shows the ProfileSetupModal when no profile exists.",
  "frontend/src/components/ThemeToggle.tsx": "Icon button that toggles between light and dark themes using the ThemeContext.",
  "frontend/src/contexts/AuthContext.tsx": "React context that wraps Internet Identity authentication, exposing isAuthenticated, login, logout (with query cache clearing), and loading states.",
  "frontend/src/contexts/ThemeContext.tsx": "React context that manages light/dark theme state, persisting the preference to localStorage and toggling the 'dark' class on the document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing it when the Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, book CRUD operations, borrowing/returning books, and borrow history retrieval.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark theme tokens including navy, gold, and sidebar color palettes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a collapsible sidebar navigation that switches between Overview, Manage Books, Manage Users, and Borrow Records tab components.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page featuring a hero section with a background video, animated statistics counters, and a feature grid showcasing the VEMU library system's capabilities.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication that redirects users to admin or student dashboard based on their role. Includes a styled form with role selector, username, password, and batch year fields (UI only) plus a login button.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that uses Internet Identity login to create a new account, showing a step-by-step guide and redirecting authenticated users to the appropriate dashboard based on role.",
  "frontend/src/pages/StudentDashboard.tsx": "Protected student dashboard with a tabbed layout containing a book catalog (browse) and a borrowed books list, with a personalized header showing the user's profile name.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Playfair Display, Inter), an extended color palette (navy, gold, warm-white), custom shadows, border radii, and keyframe animations for the library portal UI.",
  "project_state.json": "Project state manifest (version 13) describing the VEMU Library Portal's implemented features including landing page, authentication, student dashboard, and admin dashboard, along with architectural notes and known issues."
}