{
  "backend/main.mo": "Main Motoko actor defining the library management system with Book, BorrowRecord, and UserProfile types, plus CRUD operations for books, user profiles, borrowing, and returning — with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report confirming that the SELECT SYSTEM ROLE dropdown options in LoginPage.tsx are styled with a yellow (#FFD700) background and black text to match the gold theme.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-to-two sentence summaries of each frontend source file, serving as a build planning reference for the project's React/Tailwind frontend.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom property tokens for light and dark color themes including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'VEMU Institute of Technology Library Portal' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, login, signup, student dashboard (protected), and admin dashboard (protected), wrapped in ThemeProvider with a Toaster.",
  "frontend/src/components/admin/AddBookModal.tsx": "Admin dialog form for adding a new book to the library, with validation and a mutation call to persist the book data.",
  "frontend/src/components/admin/BorrowRecordsTab.tsx": "Admin tab that displays all borrow records in a searchable, filterable table with status badges for active, returned, and overdue loans.",
  "frontend/src/components/admin/ManageBooksTab.tsx": "Admin tab component for viewing, searching, and deleting books, with a table display and an AddBookModal; delete functionality is stubbed out as unsupported by the current backend.",
  "frontend/src/components/admin/ManageUsersTab.tsx": "Admin tab component that displays a searchable table of all registered users with their name, email, principal, role, and join date fetched via useGetAllUsers.",
  "frontend/src/components/admin/OverviewTab.tsx": "Admin overview tab that shows animated stat cards (total books, users, borrowed, overdue) and a quick summary list using dashboard stats from useGetDashboardStats.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a number from 0 to a target value using requestAnimationFrame with cubic ease-out easing over a configurable duration.",
  "frontend/src/components/BookCatalog.tsx": "Book catalog component with search and category filter inputs, a responsive grid of book cards, borrow buttons with loading states, and toast notifications for borrow success or failure.",
  "frontend/src/components/BorrowedBooksList.tsx": "Tabbed component displaying a user's active borrows and borrow history, with overdue detection, formatted dates, return buttons with loading states, and toast feedback.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick navigation links, contact details, and a copyright notice for the VEMU Library Portal.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, role-aware nav links (dashboard/admin), theme toggle, login/logout actions, and a mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name and email on first login and saves the profile via a mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to login, enforces optional role requirements, and shows the ProfileSetupModal when no profile exists.",
  "frontend/src/components/ThemeToggle.tsx": "Icon button that toggles between light and dark themes using the ThemeContext.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing authentication state (isAuthenticated, login, logout) built on top of useInternetIdentity, clearing the React Query cache on logout.",
  "frontend/src/contexts/ThemeContext.tsx": "React context that manages light/dark theme state, persists the preference to localStorage, and toggles the 'dark' class on the document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider implementing Internet Identity authentication using @dfinity/auth-client, exposing identity, login/clear functions, and login status flags via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, books (CRUD, borrow, return), borrow records, and admin dashboard stats, each wired to the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for light/dark themes including navy, gold, and sidebar color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a collapsible sidebar navigation that switches between Overview, Manage Books, Manage Users, and Borrow Records tab components.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page featuring a hero section, animated stats counters, and a features grid for the VEMU Institute library system.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects users to the admin or student dashboard based on their fetched role.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that triggers Internet Identity login and redirects authenticated users to either the admin or student dashboard based on their role.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page with a tabbed layout for browsing the book catalog and viewing borrowed books, displaying a personalized welcome header.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (navy, gold), fonts (Playfair Display, Inter), animations, shadows, and dark mode settings for the VEMU library portal UI.",
  "project_state.json": "Project state metadata describing the VEMU Library Portal's implemented features, architecture, and versioning, including authentication, student/admin dashboards, and landing page."
}