{
  "backend/main.mo": "Main Motoko actor defining the library management system with types and CRUD operations for books, borrow records, reservations, digital resources, announcements, and user profiles, with role-based access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding an optional `file` field (ExternalBlob) to each Book record, mapping old book entries to the new schema with `file = null`.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: fixing the Add Book button/modal, fixing the Manage Users tab in AdminDashboard, and adding a file upload field to AddBookModal with backend blob storage support.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and key fixes of each frontend source file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark themes, including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'VEMU Institute of Technology Library Portal' and mounting the React app at `#root`.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with routes for landing, login, signup, student dashboard, and admin dashboard, wrapped in QueryClient, ThemeProvider, and AuthProvider contexts.",
  "frontend/src/components/admin/AddAnnouncementModal.tsx": "A dialog modal for admins to create new announcements with title, body, priority, and publish date fields, submitting via the useAddAnnouncement mutation.",
  "frontend/src/components/admin/AddBookModal.tsx": "A dialog modal for admins to add or edit library books, supporting metadata fields and optional file upload with progress tracking via add/edit book mutations.",
  "frontend/src/components/admin/AddDigitalResourceModal.tsx": "A dialog modal for admins to add digital resources (e-books, journals, etc.) with title, description, URL, and category fields, submitting via the useAddDigitalResource mutation.",
  "frontend/src/components/admin/BorrowRecordsTab.tsx": "An admin tab that displays all borrow records in a searchable, filterable table showing book title, user principal, and borrow status (active, returned, or overdue).",
  "frontend/src/components/admin/EditAnnouncementModal.tsx": "A dialog modal for admins to edit an existing announcement's title, body, priority, and publish date, pre-populated with the selected announcement's data.",
  "frontend/src/components/admin/EditBookModal.tsx": "A modal dialog component for editing an existing book's details (title, author, category, ISBN, copies, description) with form validation and mutation via useEditBook hook.",
  "frontend/src/components/admin/EditDigitalResourceModal.tsx": "A modal dialog component for editing an existing digital resource (title, description, URL, category) with validation and mutation via useEditDigitalResource hook.",
  "frontend/src/components/admin/ManageBooksTab.tsx": "Admin tab component that displays a searchable, paginated table of all books with options to add, edit, and delete entries using respective hooks and modals.",
  "frontend/src/components/admin/ManageDigitalResourcesTab.tsx": "Admin tab component that lists all digital resources in a searchable table with add, edit, and delete functionality, delegating mutations to useGetAllDigitalResources and useDeleteDigitalResource hooks.",
  "frontend/src/components/admin/ManageUsersTab.tsx": "Admin tab component that displays a searchable table of all registered users (name, email, principal, role, join date) fetched via useGetAllUsers, with loading, error, and empty states.",
  "frontend/src/components/admin/OverviewTab.tsx": "Renders the admin dashboard overview tab with stat cards (total books, users, borrowed, overdue) and an active users card, fetching data via React Query hooks and displaying animated counters with loading skeletons.",
  "frontend/src/components/admin/ReservationsTab.tsx": "Displays a searchable, filterable table of all library reservations with approve/reject actions, mapping book and user IDs to names and showing status badges.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a number from 0 to a target value using requestAnimationFrame with a cubic ease-out curve over a configurable duration.",
  "frontend/src/components/BookCatalog.tsx": "Book catalog component with search and category filter inputs, a responsive grid of book cards with borrow buttons, loading skeletons, and error state, consuming `useGetAllBooks` and `useBorrowBook` hooks.",
  "frontend/src/components/BorrowedBooksList.tsx": "Displays a tabbed list of a user's active and returned borrowed books, with overdue detection and a return book action using mutation hooks.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, contact info, and a copyright line for VEMU Institute of Technology.",
  "frontend/src/components/MyReservations.tsx": "Shows a sorted list of the current user's book reservations with status badges and a cancel action for pending reservations.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with role-aware links, logout functionality, theme toggle, and a responsive mobile menu.",
  "frontend/src/components/NoticeBoard.tsx": "Renders a list of library announcements sorted by date, highlighting urgent ones with distinct styling and supporting an optional display limit.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name and email on first login and saves the profile via a mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to login and users with wrong roles to their appropriate pages, showing a loading spinner while auth state resolves.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes, displaying a Sun or Moon icon based on the current theme.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context including user role, persisted principal, admin password login state, and logout logic, with localStorage persistence and backend role fetching via the actor.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a light/dark theme context that persists the selected theme to localStorage and toggles the `dark` CSS class on the document root.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication hook and provider using DFINITY's AuthClient, exposing identity, login/clear functions, and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the application, covering CRUD and action mutations for books, borrow/return records, reservations, users, digital resources, and announcements via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes including navy, gold, and sidebar color tokens, plus reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a collapsible sidebar and four tabs (Overview, Manage Books, Manage Users, Borrow Records), guarded by authentication and admin role checks.",
  "frontend/src/pages/DigitalResources.tsx": "Page that fetches and displays digital library resources with search input and category filter chips, showing category-specific icons and a resource count summary.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page featuring a hero section with a background video, animated stat counters, and a features grid for the VEMU Institute library system.",
  "frontend/src/pages/LoginPage.tsx": "Login page supporting both email/password admin login (hardcoded credentials) and Internet Identity login, with role-based redirect to admin or user dashboard after authentication.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that authenticates users via Internet Identity, fetches their role after login, and redirects admins to /admin or others to /dashboard. Displays a step-by-step onboarding UI with a single 'Create Account' button.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page with tabs for browsing the book catalog and viewing borrowed books. Redirects unauthenticated users to login and shows a profile setup modal if no profile exists.",
  "frontend/src/pages/StudentProfile.tsx": "Student profile page displaying user info, active loans, borrow history, and reservations fetched via query hooks. Renders loading skeletons while data is being fetched.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, with helpers to persist values in sessionStorage and remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Inter), OKLCH-based color tokens (navy, gold, semantic colors), custom shadows, and keyframe animations. Enables dark mode via class and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking the VEMU Library Portal's known issues, existing features, and pending fix requests—specifically around the admin panel's Add Book button, Manage Users tab, and book file upload functionality."
}