{
  "kind": "build_request",
  "title": "Fix Add Book & Manage Users buttons, and add book file upload for admins",
  "projectName": "VEMU Library Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Add Book button in the ManageBooksTab admin panel so that clicking it reliably opens the AddBookModal dialog. The modal must render correctly, all form fields (title, author, category, ISBN, copies, description) must be interactive, and submitting the form must invoke the add book mutation and close the modal on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "fix the Add Book and Manage Users buttons"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Add Book' in ManageBooksTab opens the AddBookModal without errors.",
        "All form fields in AddBookModal are editable and validated before submission.",
        "Submitting the form calls the backend add-book mutation and the book list refreshes on success.",
        "The modal closes after a successful add and shows an error message on failure."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the Manage Users button/tab in the AdminDashboard so that clicking it correctly switches to the ManageUsersTab. The tab must load and display the full list of registered users (name, email, principal, role, join date) fetched via the useGetAllUsers hook, with a working search input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "fix the Add Book and Manage Users buttons"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Manage Users' in the AdminDashboard sidebar/tab bar navigates to the ManageUsersTab without errors.",
        "The ManageUsersTab renders a table of all users fetched from the backend.",
        "Search input in ManageUsersTab correctly filters the displayed user list.",
        "Loading and error states are handled gracefully."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a book file upload field to the AddBookModal (and EditBookModal where appropriate) so admins can select and upload a book file (PDF or ePub) from their device. The uploaded file content should be stored on the backend as a blob associated with the book record. The backend actor must be updated to store an optional file blob per book. The upload field should display the selected filename and a progress/success indicator.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "allow admins to upload book files",
          "it takes open file and upload file of book in our website"
        ]
      },
      "acceptanceCriteria": [
        "The AddBookModal contains a file input that accepts PDF and ePub files.",
        "After selecting a file, the filename is displayed next to the input.",
        "On form submission, the file bytes are sent to the backend and stored as an optional blob on the book record.",
        "The backend Motoko actor stores an optional file blob field on the Book type and exposes an uploadBookFile or equivalent update call.",
        "A success indicator is shown when the upload completes; an error message is shown on failure.",
        "Existing books without a file are not affected by the schema change."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All backend Motoko logic must remain in the single actor in backend/main.mo.",
    "Generate migration.mo if the Book type schema changes to add the file blob field."
  ],
  "nonGoals": [
    "Adding student-facing file download functionality (out of scope for this request).",
    "Changing the authentication or role-based access control logic.",
    "Modifying the digital resources or announcements features.",
    "Adding external file storage — files must be stored directly in the canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}