{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix missing features — Book Catalog empty, Student/Admin Dashboard not rendering data",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix Book Catalog data fetching and rendering so books are displayed correctly",
      "acceptanceCriteria": [
        "Books stored in the backend canister are returned by the `getAllBooks` query",
        "The Book Catalog on the Student Dashboard shows the correct book count (e.g., 'Showing X of Y books')",
        "Individual book cards are rendered with title, author, category, and borrow/reserve actions",
        "Search and category filter controls produce correct filtered results"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useGetAllBooks hook to correctly call the backend actor method `getAllBooksSortedByTitle` instead of `getAllBooks`. Ensure the query is enabled only when the actor is available and not fetching. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BookCatalog.tsx",
          "operation": "modify",
          "description": "Verify that the BookCatalog component correctly consumes the data from useGetAllBooks hook. Ensure loading states, error states, and empty states are properly handled. Confirm that book count display ('Showing X of Y books') correctly reflects the filtered results length and total books length. Verify search and category filtering logic produces the correct filtered array before rendering book cards."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix Student Dashboard tabs so Browse Books and My Borrowed Books render correctly",
      "acceptanceCriteria": [
        "Navigating to `/dashboard` renders the StudentDashboard page without a blank screen",
        "The 'Browse Books' tab displays the book catalog with data",
        "The 'My Borrowed Books' tab displays the user's active and historical borrowings",
        "No console errors related to undefined actor methods or missing routes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentDashboard.tsx",
          "operation": "modify",
          "description": "Verify that the StudentDashboard page component correctly mounts and renders both tabs. Ensure the BookCatalog component is rendered in the 'Browse Books' tab and BorrowedBooksList is rendered in the 'My Borrowed Books' tab. Check that the component properly handles loading and error states for the user profile query (useGetCallerUserProfile). Confirm no undefined references or missing imports."
        },
        {
          "path": "frontend/src/components/BorrowedBooksList.tsx",
          "operation": "modify",
          "description": "Review the BorrowedBooksList component to ensure it correctly calls useGetMyBorrowHistory and useGetAllBooks hooks. Verify that the component properly maps book IDs to book details and handles cases where book data might be missing. Ensure loading skeletons and empty states are displayed appropriately."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useGetMyBorrowHistory hook to ensure it correctly calls the backend actor method `getMyBorrowHistory`. Verify the query is enabled only when the actor is available and the user is authenticated. Ensure proper error handling and retry logic."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix Admin Dashboard so all tabs load and display data correctly",
      "acceptanceCriteria": [
        "Navigating to `/admin` as an admin user renders the AdminDashboard with sidebar and tabs",
        "The Overview tab displays stat cards with real data (total books, users, borrowed, overdue)",
        "The Manage Books tab lists all books with add/edit/delete actions functional",
        "The Manage Users tab lists all registered users",
        "The Borrow Records tab lists all borrow records with correct status indicators",
        "Non-admin users are redirected away from `/admin`"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Verify that the AdminDashboard page component is properly protected by the admin role guard via ProtectedRoute. Ensure all four tabs (Overview, Manage Books, Manage Users, Borrow Records) are correctly wired and render their respective components. Check that the sidebar navigation and tab switching logic works correctly without console errors."
        },
        {
          "path": "frontend/src/components/admin/OverviewTab.tsx",
          "operation": "modify",
          "description": "Review the OverviewTab component to ensure it correctly calls useGetDashboardStats and useGetActiveUserCount hooks. Verify that stat cards display real data from the backend. Ensure loading states and error handling are properly implemented. Confirm AnimatedCounter components receive correct values."
        },
        {
          "path": "frontend/src/components/admin/ManageBooksTab.tsx",
          "operation": "modify",
          "description": "Verify that ManageBooksTab correctly calls useGetAllBooks hook and displays books in a searchable, paginated table. Ensure add, edit, and delete actions are properly wired to their respective modals and mutations (useAddBook, useEditBook, useDeleteBook). Confirm role-based access control is enforced."
        },
        {
          "path": "frontend/src/components/admin/ManageUsersTab.tsx",
          "operation": "modify",
          "description": "Review ManageUsersTab to ensure it correctly calls useGetAllUsers hook and displays users in a searchable table. Verify that user data (name, email, principal, role, join date) is properly mapped and rendered. Ensure loading and empty states are handled."
        },
        {
          "path": "frontend/src/components/admin/BorrowRecordsTab.tsx",
          "operation": "modify",
          "description": "Verify that BorrowRecordsTab correctly calls useGetAllBorrowRecords and useGetAllBooks hooks. Ensure borrow records are displayed with correct status indicators (active, returned, overdue). Confirm search and filter functionality works as expected. Verify proper mapping of book IDs to book titles."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix all admin-related query hooks (useGetDashboardStats, useGetAllUsers, useGetAllBorrowRecords, useGetActiveUserCount) to ensure they correctly call their corresponding backend actor methods. Verify queries are enabled only when the actor is available and the user has admin role. Ensure proper error handling and data transformation where needed."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Fix actor initialization to ensure it's available before queries run",
      "acceptanceCriteria": [
        "The actor is initialized and available before dependent queries run",
        "React Query hooks do not fire with an undefined actor",
        "All queries transition from 'loading' to 'success' with data once the user is authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all query and mutation hooks in useQueries.ts to ensure they properly check for actor availability using `enabled: !!actor && !isFetching`. Verify that hooks correctly handle the case where actor is null/undefined and wait for it to be initialized before executing queries. Ensure consistent error handling across all hooks. Add proper TypeScript null checks where needed."
        },
        {
          "path": "frontend/src/components/BookCatalog.tsx",
          "operation": "modify",
          "description": "Ensure the BookCatalog component properly handles the loading state from useGetAllBooks by checking both `isLoading` and actor fetching state. Display loading skeletons while data is being fetched. Ensure the component does not attempt to render data before the actor is initialized."
        },
        {
          "path": "frontend/src/pages/StudentDashboard.tsx",
          "operation": "modify",
          "description": "Verify that StudentDashboard waits for the actor to be initialized before rendering tabs. Use the loading state from useGetCallerUserProfile to show a loading spinner or skeleton while the session is initializing. Ensure no component attempts to call backend capabilities before authentication is complete."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Ensure AdminDashboard properly waits for actor initialization and role verification before rendering tabs. Display a loading state while authentication and authorization are in progress. Verify that ProtectedRoute correctly guards the admin dashboard from non-admin users."
        }
      ]
    }
  ]
}