{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add Book & Manage Users buttons, and add book file upload for admins",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the Add Book button in ManageBooksTab so clicking it reliably opens the AddBookModal with all interactive form fields, proper submission flow, and modal close on success",
      "acceptanceCriteria": [
        "Clicking 'Add Book' in ManageBooksTab opens the AddBookModal without errors.",
        "All form fields in AddBookModal are editable and validated before submission.",
        "Submitting the form calls the backend add-book mutation and the book list refreshes on success.",
        "The modal closes after a successful add and shows an error message on failure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ManageBooksTab.tsx",
          "operation": "modify",
          "description": "Fix the Add Book button onClick handler to correctly set the isAddModalOpen state to true. Ensure the button is not disabled and that the modal state management is properly wired. Verify the AddBookModal component is correctly imported and rendered with the open prop bound to isAddModalOpen and onOpenChange bound to setIsAddModalOpen."
        },
        {
          "path": "frontend/src/components/admin/AddBookModal.tsx",
          "operation": "modify",
          "description": "Verify and fix the modal's open/close state handling. Ensure the Dialog component from shadcn/ui is correctly configured with open and onOpenChange props. Check that all form fields (title, author, category, ISBN, copies, description) are properly bound to form state with onChange handlers. Ensure form validation runs before submission. Fix the submit handler to call the useAddBook mutation hook, handle success by closing the modal and invalidating the books query, and display error messages on failure. Add proper loading state during submission."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the Manage Users button/tab in AdminDashboard so clicking it switches to ManageUsersTab and displays the full user list with working search",
      "acceptanceCriteria": [
        "Clicking 'Manage Users' in the AdminDashboard sidebar/tab bar navigates to the ManageUsersTab without errors.",
        "The ManageUsersTab renders a table of all users fetched from the backend.",
        "Search input in ManageUsersTab correctly filters the displayed user list.",
        "Loading and error states are handled gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Fix the tab navigation to correctly set activeTab to 'users' when the Manage Users button/tab is clicked. Ensure the button onClick handler updates the activeTab state. Verify that when activeTab === 'users', the ManageUsersTab component is rendered in the main content area. Check that the ManageUsersTab component is correctly imported and that no conditional logic prevents it from rendering."
        },
        {
          "path": "frontend/src/components/admin/ManageUsersTab.tsx",
          "operation": "modify",
          "description": "Verify the useGetAllUsers hook is correctly called and that the returned data is properly mapped to the table rows. Ensure the search input state is wired to filter the displayed users array by name, email, or principal. Fix any issues with the table rendering logic, ensuring all columns (name, email, principal, role, join date) are displayed. Add proper loading skeletons while data is fetching and error state handling if the query fails. Ensure the search filter logic is case-insensitive and works across all relevant fields."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a book file upload field to AddBookModal and EditBookModal allowing admins to select and upload PDF/ePub files, with the file content stored as a blob on the backend and UI feedback for filename, progress, and success/error",
      "acceptanceCriteria": [
        "The AddBookModal contains a file input that accepts PDF and ePub files.",
        "After selecting a file, the filename is displayed next to the input.",
        "On form submission, the file bytes are sent to the backend and stored as an optional blob on the book record.",
        "The backend Motoko actor stores an optional file blob field on the Book type and exposes an uploadBookFile or equivalent update call.",
        "A success indicator is shown when the upload completes; an error message is shown on failure.",
        "Existing books without a file are not affected by the schema change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AddBookModal.tsx",
          "operation": "modify",
          "description": "Add a file input field below the description field that accepts .pdf and .epub file types. Add form state to track the selected file (File object) and display the selected filename when a file is chosen. Import ExternalBlob from the backend types. On form submission, if a file is selected, read it as an ArrayBuffer using FileReader, convert to Uint8Array, create an ExternalBlob via ExternalBlob.fromBytes(), and attach a progress callback using withUploadProgress() to update a progress state variable. Include the ExternalBlob in the BookCreateData payload passed to the useAddBook mutation. Display a progress indicator (percentage) while the file is uploading. Show a success message when the upload completes and an error message if it fails. Ensure the file field is optional and the form can be submitted without a file."
        },
        {
          "path": "frontend/src/components/admin/EditBookModal.tsx",
          "operation": "modify",
          "description": "Add a file input field similar to AddBookModal. If the book being edited already has a file, display a message showing the current file exists (e.g., 'Current file: Uploaded') and allow the admin to optionally select a new file to replace it. Track the selected file in form state and display the new filename when chosen. On form submission, if a new file is selected, read it as an ArrayBuffer, convert to Uint8Array, create an ExternalBlob with progress tracking, and include it in the BookCreateData payload. If no new file is selected, preserve the existing file reference from the book prop. Display progress, success, and error states as in AddBookModal. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useAddBook and useEditBook mutation hooks to ensure they correctly serialize the BookCreateData payload including the optional file field of type ExternalBlob. Verify that the actor method signatures in backend.d.ts match (addBook and editBook both accept BookCreateData with an optional file?: ExternalBlob field). Ensure the mutations invalidate the 'books' query key on success so the book list refreshes with the new file data. No changes should be needed if the backend interface already supports the file field, but verify the type definitions are correctly imported and used."
        }
      ]
    }
  ]
}